package chapter06;

public class MethodsAdvanced {
    /*
    再谈方法之1：方法的重载(overload)
    OverloadTest
    1. 定义：在同一个类中，允许存在一个以上的同名方法，只要它们的参数列表不同即可。
            满足这样特征的多个方法，彼此之间构成方法的重载。
    2. 总结为：“两同一不同”
         两同：同一个类、相同的方法名
         一不同：参数列表不同。① 参数个数不同 ② 参数类型不同
         注意：方法的重载与形参的名、权限修饰符、返回值类型都没有关系。
    3. 举例
    Arrays类中sort(xxx[] arr)、binarySearch(xxx[] arr,xxx)、equals(xxx[] ,yyy[])
    4. 如何判断两个方法是相同的呢？
    方法名相同，且形参列表相同。（形参列表相同指的是参数个数和类型都相同，与形参名没关系）
    要求：在一个类中，允许存在多个相同名字的方法，只要他们的形参列表不同即可。
    编译器是如何确定调用的某个具体的方法呢？
    先通过方法名确定了一波重载的方法，进而通过不同的形参列表，确定具体的某一个方法。
    5. 在同一个类中不允许定义两个相同的方法。


    再谈方法之2：可变个数形参的方法(jdk5.0)
    ArgsTest
    1. 使用场景
    在调用方法时，可能会出现方法形参的类型是确定的，但是参数的个数不确定。此时，我们就可以使用可变个数形参的方法
    2. 格式：(参数类型 ... 参数名)
    3. 说明：
    ① 可变个数形参的方法在调用时，针对于可变的形参赋的实参的个数可以为：0个、1个或多个
    ② 可变个数形参的方法与同一个类中，同名的多个方法之间可以构成重载
    ③ 特例：可变个数形参的方法与同一个类中方法名相同，且与可变个数形参的类型相同的数组参数不构成重载。
    ④ 可变个数的形参必须声明在形参列表的最后
    ⑤ 可变个数的形参最多在一个方法的形参列表中出现一次


    再谈方法之3：方法的值传递机制
    ValueTransferTest
    1. （复习）对于方法内声明的局部变量来说：如果出现赋值操作
        > 如果是基本数据类型的变量，则将此变量保存的数据值传递出去。
        > 如果是引用数据类型的变量，则将此变量保存的地址值传递出去。
    2. 方法的参数的传递机制：值传递机制
    2.1 概念（复习）
    形参：在定义方法时，方法名后面括号()中声明的变量称为形式参数，简称形参。
    实参：在调用方法时，方法名后面括号()中的使用的值/变量/表达式称为实际参数，简称实参。
    2.2 规则：实参给形参赋值的过程
        > 如果形参是基本数据类型的变量，则将实参保存的数据值赋给形参。
        > 如果形参是引用数据类型的变量，则将实参保存的地址值赋给形参。
    3. 面试题：Java中的参数传递机制是什么？
             值传递。（不是引用传递）


    再谈方法之4：递归方法
    1. 何为递归方法？
    方法自己调用自己的现象就称为递归。
    2. 递归方法分类：直接递归、间接递归
    3. 使用说明：
    - 递归方法包含了一种`隐式的循环`。
    - 递归方法会`重复执行`某段代码，但这种重复执行无须循环控制。
    - 递归一定要向`已知方向`递归，否则这种递归就变成了无穷递归，停不下来，类似于`死循环`。最终发生`栈内存溢出`。
    注意：
    1. 递归调用会占用大量的系统堆栈，内存耗用多，在递归调用层次多时速度要比循环`慢的多`，所以在使用递归时要慎重。
    2. 在要求高性能的情况下尽量避免使用递归，递归调用既花时间又`耗内存`。考虑使用循环迭代


     */
}
